read -sv ../FloatingPointMul.sv ../FloatingPointRound.sv
synth -top FloatingPointMul
proc; opt
techmap; opt
dfflibmap -liberty osu018_stdcells.lib
abc -D 10000 -liberty osu018_stdcells.lib
stat -liberty osu018_stdcells.lib
