read -sv PrefixAdder.v
read_liberty -lib osu018_stdcells.lib
hierarchy -check -top PrefixAdder
proc; opt
memory; opt
fsm; opt
techmap; opt
dfflibmap -liberty osu018_stdcells.lib
abc -D 10000 -liberty osu018_stdcells.lib
stat -liberty osu018_stdcells.lib