read -sv Multiplier.sv
read_liberty -lib osu018_stdcells.lib
hierarchy -check -top Multiplier
proc; opt
memory; opt
fsm; opt
techmap; opt
dfflibmap -liberty osu018_stdcells.lib
abc -D 10000 -liberty osu018_stdcells.lib
stat -liberty osu018_stdcells.lib