read -sv ../FloatingPointAdd2path.sv ../FloatingPointRound.sv
synth -top FloatingPointAdd2path
proc; opt
fsm; opt
memory; opt
techmap; opt
flatten
dfflibmap -liberty osu018_stdcells.lib
abc -D 10000 -liberty osu018_stdcells.lib
stat -liberty osu018_stdcells.lib
