read -sv ../FloatingPointAdd.sv ../FloatingPointRound.sv
synth -top FloatingPointAdd
proc; opt
fsm; opt
memory; opt
techmap; opt
flatten
dfflibmap -liberty osu018_stdcells.lib
abc -D 10000 -constr example.constr -liberty osu018_stdcells.lib
stat -liberty osu018_stdcells.lib
